MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33FJ32GS610/mcu.h
#define ADCPC2 ADCPC2
extern volatile uint16_t ADCPC2 __attribute__((__sfr__));
__extension__ typedef struct tagADCPC2BITS {
  union {
    struct {
      uint16_t TRGSRC4:5;
      uint16_t SWTRG4:1;
      uint16_t PEND4:1;
      uint16_t IRQEN4:1;
      uint16_t TRGSRC5:5;
      uint16_t SWTRG5:1;
      uint16_t PEND5:1;
      uint16_t IRQEN5:1;
    };
    struct {
      uint16_t TRGSRC40:1;
      uint16_t TRGSRC41:1;
      uint16_t TRGSRC42:1;
      uint16_t TRGSRC43:1;
      uint16_t TRGSRC44:1;
      uint16_t :3;
      uint16_t TRGSRC50:1;
      uint16_t TRGSRC51:1;
      uint16_t TRGSRC52:1;
      uint16_t TRGSRC53:1;
      uint16_t TRGSRC54:1;
    };
  };
} ADCPC2BITS;
extern volatile ADCPC2BITS ADCPC2bits __attribute__((__sfr__));

#define ADCPC3 ADCPC3
extern volatile uint16_t ADCPC3 __attribute__((__sfr__));
__extension__ typedef struct tagADCPC3BITS {
  union {
    struct {
      uint16_t TRGSRC6:5;
      uint16_t SWTRG6:1;
      uint16_t PEND6:1;
      uint16_t IRQEN6:1;
      uint16_t TRGSRC7:5;
      uint16_t SWTRG7:1;
      uint16_t PEND7:1;
      uint16_t IRQEN7:1;
    };
    struct {
      uint16_t TRGSRC60:1;
      uint16_t TRGSRC61:1;
      uint16_t TRGSRC62:1;
      uint16_t TRGSRC63:1;
      uint16_t TRGSRC64:1;
      uint16_t :3;
      uint16_t TRGSRC70:1;
      uint16_t TRGSRC71:1;
      uint16_t TRGSRC72:1;
      uint16_t TRGSRC73:1;
      uint16_t TRGSRC74:1;
    };
  };
} ADCPC3BITS;
extern volatile ADCPC3BITS ADCPC3bits __attribute__((__sfr__));

#define ADCPC4 ADCPC4
extern volatile uint16_t ADCPC4 __attribute__((__sfr__));
typedef struct tagADCPC4BITS {
  uint16_t TRGSRC8:5;
  uint16_t SWTRG8:1;
  uint16_t PEND8:1;
  uint16_t IRQEN8:1;
  uint16_t TRGSRC9:5;
  uint16_t SWTRG9:1;
  uint16_t PEND9:1;
  uint16_t IRQEN9:1;
} ADCPC4BITS;
extern volatile ADCPC4BITS ADCPC4bits __attribute__((__sfr__));

#define ADCPC5 ADCPC5
extern volatile uint16_t ADCPC5 __attribute__((__sfr__));
typedef struct tagADCPC5BITS {
  uint16_t TRGSRC10:5;
  uint16_t SWTRG10:1;
  uint16_t PEND10:1;
  uint16_t IRQEN10:1;
  uint16_t TRGSRC11:5;
  uint16_t SWTRG11:1;
  uint16_t PEND11:1;
  uint16_t IRQEN11:1;
} ADCPC5BITS;
extern volatile ADCPC5BITS ADCPC5bits __attribute__((__sfr__));

#define ADCPC6 ADCPC6
extern volatile uint16_t ADCPC6 __attribute__((__sfr__));
__extension__ typedef struct tagADCPC6BITS {
  union {
    struct {
      uint16_t TRGSRC12:5;
      uint16_t SWTRG12:1;
      uint16_t PEND12:1;
      uint16_t IRQEN12:1;
    };
    struct {
      uint16_t TRGSRC120:1;
      uint16_t TRGSRC121:1;
      uint16_t TRGSRC122:1;
      uint16_t TRGSRC123:1;
      uint16_t TRGSRC124:1;
    };
  };
} ADCPC6BITS;
extern volatile ADCPC6BITS ADCPC6bits __attribute__((__sfr__));

#define ADCBUF0 ADCBUF0
extern volatile uint16_t ADCBUF0 __attribute__((__sfr__));
#define ADCBUF1 ADCBUF1
extern volatile uint16_t ADCBUF1 __attribute__((__sfr__));
#define ADCBUF2 ADCBUF2
extern volatile uint16_t ADCBUF2 __attribute__((__sfr__));
#define ADCBUF3 ADCBUF3
extern volatile uint16_t ADCBUF3 __attribute__((__sfr__));
#define ADCBUF4 ADCBUF4
extern volatile uint16_t ADCBUF4 __attribute__((__sfr__));
#define ADCBUF5 ADCBUF5
extern volatile uint16_t ADCBUF5 __attribute__((__sfr__));
#define ADCBUF6 ADCBUF6
extern volatile uint16_t ADCBUF6 __attribute__((__sfr__));
#define ADCBUF7 ADCBUF7
extern volatile uint16_t ADCBUF7 __attribute__((__sfr__));
#define ADCBUF8 ADCBUF8
extern volatile uint16_t ADCBUF8 __attribute__((__sfr__));
#define ADCBUF9 ADCBUF9
extern volatile uint16_t ADCBUF9 __attribute__((__sfr__));
#define ADCBUF10 ADCBUF10
extern volatile uint16_t ADCBUF10 __attribute__((__sfr__));
#define ADCBUF11 ADCBUF11
extern volatile uint16_t ADCBUF11 __attribute__((__sfr__));
#define ADCBUF12 ADCBUF12
extern volatile uint16_t ADCBUF12 __attribute__((__sfr__));
#define ADCBUF13 ADCBUF13
extern volatile uint16_t ADCBUF13 __attribute__((__sfr__));
#define ADCBUF14 ADCBUF14
extern volatile uint16_t ADCBUF14 __attribute__((__sfr__));
#define ADCBUF15 ADCBUF15
extern volatile uint16_t ADCBUF15 __attribute__((__sfr__));
#define ADCBUF16 ADCBUF16
extern volatile uint16_t ADCBUF16 __attribute__((__sfr__));
#define ADCBUF17 ADCBUF17
extern volatile uint16_t ADCBUF17 __attribute__((__sfr__));
#define ADCBUF18 ADCBUF18
extern volatile uint16_t ADCBUF18 __attribute__((__sfr__));
#define ADCBUF19 ADCBUF19
extern volatile uint16_t ADCBUF19 __attribute__((__sfr__));
#define ADCBUF20 ADCBUF20
extern volatile uint16_t ADCBUF20 __attribute__((__sfr__));
#define ADCBUF21 ADCBUF21
extern volatile uint16_t ADCBUF21 __attribute__((__sfr__));
#define ADCBUF22 ADCBUF22
extern volatile uint16_t ADCBUF22 __attribute__((__sfr__));
#define ADCBUF23 ADCBUF23
extern volatile uint16_t ADCBUF23 __attribute__((__sfr__));
#define ADCBUF24 ADCBUF24
extern volatile uint16_t ADCBUF24 __attribute__((__sfr__));
#define ADCBUF25 ADCBUF25
extern volatile uint16_t ADCBUF25 __attribute__((__sfr__));
#define PTCON PTCON
extern volatile uint16_t PTCON __attribute__((__sfr__));
__extension__ typedef struct tagPTCONBITS {
  union {
    struct {
      uint16_t SEVTPS:4;
      uint16_t SYNCSRC:3;
      uint16_t SYNCEN:1;
      uint16_t SYNCOEN:1;
      uint16_t SYNCPOL:1;
      uint16_t EIPU:1;
      uint16_t SEIEN:1;
      uint16_t SESTAT:1;
      uint16_t PTSIDL:1;
      uint16_t :1;
      uint16_t PTEN:1;
    };
    struct {
      uint16_t SEVTPS0:1;
      uint16_t SEVTPS1:1;
      uint16_t SEVTPS2:1;
      uint16_t SEVTPS3:1;
      uint16_t SYNCSRC0:1;
      uint16_t SYNCSRC1:1;
      uint16_t SYNCSRC2:1;
    };
  };
} PTCONBITS;
extern volatile PTCONBITS PTCONbits __attribute__((__sfr__));

#define PTCON2 PTCON2
extern volatile uint16_t PTCON2 __attribute__((__sfr__));
__extension__ typedef struct tagPTCON2BITS {
  union {
    struct {
      uint16_t PCLKDIV:3;
    };
    struct {
      uint16_t PCLKDIV0:1;
      uint16_t PCLKDIV1:1;
      uint16_t PCLKDIV2:1;
    };
  };
} PTCON2BITS;
extern volatile PTCON2BITS PTCON2bits __attribute__((__sfr__));

#define PTPER PTPER
extern volatile uint16_t PTPER __attribute__((__sfr__));
#define SEVTCMP SEVTCMP
extern volatile uint16_t SEVTCMP __attribute__((__sfr__));
#define MDC MDC
extern volatile uint16_t MDC __attribute__((__sfr__));
#define STCON STCON
extern volatile uint16_t STCON __attribute__((__sfr__));
__extension__ typedef struct tagSTCONBITS {
  union {
    struct {
      uint16_t SEVTPS:4;
      uint16_t SYNCSRC:3;
      uint16_t SYNCEN:1;
      uint16_t SYNCOEN:1;
      uint16_t SYNCPOL:1;
      uint16_t EIPU:1;
      uint16_t SEIEN:1;
      uint16_t SESTAT:1;
    };
    struct {
      uint16_t SEVTPS0:1;
      uint16_t SEVTPS1:1;
      uint16_t SEVTPS2:1;
      uint16_t SEVTPS3:1;
      uint16_t SYNCSRC0:1;
      uint16_t SYNCSRC1:1;
      uint16_t SYNCSRC2:1;
    };
  };
} STCONBITS;
extern volatile STCONBITS STCONbits __attribute__((__sfr__));

#define STCON2 STCON2
extern volatile uint16_t STCON2 __attribute__((__sfr__));
__extension__ typedef struct tagSTCON2BITS {
  union {
    struct {
      uint16_t PCLKDIV:3;
    };
    struct {
      uint16_t PCLKDIV0:1;
      uint16_t PCLKDIV1:1;
      uint16_t PCLKDIV2:1;
    };
  };
} STCON2BITS;
extern volatile STCON2BITS STCON2bits __attribute__((__sfr__));

#define STPER STPER
extern volatile uint16_t STPER __attribute__((__sfr__));
#define SSEVTCMP SSEVTCMP
extern volatile uint16_t SSEVTCMP __attribute__((__sfr__));
#define CHOP CHOP
extern volatile uint16_t CHOP __attribute__((__sfr__));
__extension__ typedef struct tagCHOPBITS {
  union {
    struct {
      uint16_t :3;
      uint16_t CHOPCLK:7;
      uint16_t :5;
      uint16_t CHPCLKEN:1;
    };
    struct {
      uint16_t :3;
      uint16_t CHOPCLK0:1;
      uint16_t CHOPCLK1:1;
      uint16_t CHOPCLK2:1;
      uint16_t CHOPCLK3:1;
      uint16_t CHOPCLK4:1;
      uint16_t CHOPCLK5:1;
      uint16_t CHOPCLK6:1;
    };
  };
} CHOPBITS;
extern volatile CHOPBITS CHOPbits __attribute__((__sfr__));

#define PWMCON1 PWMCON1
extern volatile uint16_t PWMCON1 __attribute__((__sfr__));
__extension__ typedef struct tagPWMCON1BITS {
  union {
    struct {
      uint16_t IUE:1;
      uint16_t XPRES:1;
      uint16_t CAM:1;
      uint16_t MTBS:1;
      uint16_t :1;
      uint16_t DTCP:1;
      uint16_t DTC:2;
      uint16_t MDCS:1;
      uint16_t ITB:1;
      uint16_t TRGIEN:1;
      uint16_t CLIEN:1;
      uint16_t FLTIEN:1;
      uint16_t TRGSTAT:1;
      uint16_t CLSTAT:1;
      uint16_t FLTSTAT:1;
    };
    struct {
      uint16_t :6;
      uint16_t DTC0:1;
      uint16_t DTC1:1;
    };
  };
} PWMCON1BITS;
