MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33FJ32GS610/mcu.h
#define TRGCON8 TRGCON8
extern volatile uint16_t TRGCON8 __attribute__((__sfr__));
__extension__ typedef struct tagTRGCON8BITS {
  union {
    struct {
      uint16_t TRGSTRT:6;
      uint16_t :1;
      uint16_t DTM:1;
      uint16_t :4;
      uint16_t TRGDIV:4;
    };
    struct {
      uint16_t TRGSTRT0:1;
      uint16_t TRGSTRT1:1;
      uint16_t TRGSTRT2:1;
      uint16_t TRGSTRT3:1;
      uint16_t TRGSTRT4:1;
      uint16_t TRGSTRT5:1;
      uint16_t :6;
      uint16_t TRGDIV0:1;
      uint16_t TRGDIV1:1;
      uint16_t TRGDIV2:1;
      uint16_t TRGDIV3:1;
    };
  };
} TRGCON8BITS;
extern volatile TRGCON8BITS TRGCON8bits __attribute__((__sfr__));

#define STRIG8 STRIG8
extern volatile uint16_t STRIG8 __attribute__((__sfr__));
__extension__ typedef struct tagSTRIG8BITS {
  union {
    struct {
      uint16_t :3;
      uint16_t STRGCMP:13;
    };
    struct {
      uint16_t :3;
      uint16_t STRGCMP0:1;
      uint16_t STRGCMP1:1;
      uint16_t STRGCMP2:1;
      uint16_t STRGCMP3:1;
      uint16_t STRGCMP4:1;
      uint16_t STRGCMP5:1;
      uint16_t STRGCMP6:1;
      uint16_t STRGCMP7:1;
      uint16_t STRGCMP8:1;
      uint16_t STRGCMP9:1;
      uint16_t STRGCMP10:1;
      uint16_t STRGCMP11:1;
      uint16_t STRGCMP12:1;
    };
  };
} STRIG8BITS;
extern volatile STRIG8BITS STRIG8bits __attribute__((__sfr__));

#define PWMCAP8 PWMCAP8
extern volatile uint16_t PWMCAP8 __attribute__((__sfr__));
#define LEBCON8 LEBCON8
extern volatile uint16_t LEBCON8 __attribute__((__sfr__));
typedef struct tagLEBCON8BITS {
  uint16_t BPLL:1;
  uint16_t BPLH:1;
  uint16_t BPHL:1;
  uint16_t BPHH:1;
  uint16_t BCL:1;
  uint16_t BCH:1;
  uint16_t :4;
  uint16_t CLLEBEN:1;
  uint16_t FLTLEBEN:1;
  uint16_t PLF:1;
  uint16_t PLR:1;
  uint16_t PHF:1;
  uint16_t PHR:1;
} LEBCON8BITS;
extern volatile LEBCON8BITS LEBCON8bits __attribute__((__sfr__));

#define LEBDLY8 LEBDLY8
extern volatile uint16_t LEBDLY8 __attribute__((__sfr__));
__extension__ typedef struct tagLEBDLY8BITS {
  union {
    struct {
      uint16_t :3;
      uint16_t LEB:9;
    };
    struct {
      uint16_t :3;
      uint16_t LEB0:1;
      uint16_t LEB1:1;
      uint16_t LEB2:1;
      uint16_t LEB3:1;
      uint16_t LEB4:1;
      uint16_t LEB5:1;
      uint16_t LEB6:1;
      uint16_t LEB7:1;
      uint16_t LEB8:1;
    };
  };
} LEBDLY8BITS;
extern volatile LEBDLY8BITS LEBDLY8bits __attribute__((__sfr__));

#define AUXCON8 AUXCON8
extern volatile uint16_t AUXCON8 __attribute__((__sfr__));
__extension__ typedef struct tagAUXCON8BITS {
  union {
    struct {
      uint16_t CHOPLEN:1;
      uint16_t CHOPHEN:1;
      uint16_t CHOPSEL:4;
      uint16_t :2;
      uint16_t BLANKSEL:4;
      uint16_t :2;
      uint16_t HRDDIS:1;
      uint16_t HRPDIS:1;
    };
    struct {
      uint16_t :2;
      uint16_t CHOPSEL0:1;
      uint16_t CHOPSEL1:1;
      uint16_t CHOPSEL2:1;
      uint16_t CHOPSEL3:1;
      uint16_t :2;
      uint16_t BLANKSEL0:1;
      uint16_t BLANKSEL1:1;
      uint16_t BLANKSEL2:1;
      uint16_t BLANKSEL3:1;
    };
  };
} AUXCON8BITS;
extern volatile AUXCON8BITS AUXCON8bits __attribute__((__sfr__));

#define PWMCON9 PWMCON9
extern volatile uint16_t PWMCON9 __attribute__((__sfr__));
typedef struct tagPWMCON9BITS {
  uint16_t IUE:1;
  uint16_t XPRES:1;
  uint16_t CAM:1;
  uint16_t MTBS:1;
  uint16_t :1;
  uint16_t DTCP:1;
  uint16_t DTC:2;
  uint16_t MDCS:1;
  uint16_t ITB:1;
  uint16_t TRGIEN:1;
  uint16_t CLIEN:1;
  uint16_t FLTIEN:1;
  uint16_t TRGSTAT:1;
  uint16_t CLSTAT:1;
  uint16_t FLTSTAT:1;
} PWMCON9BITS;
extern volatile PWMCON9BITS PWMCON9bits __attribute__((__sfr__));

#define IOCON9 IOCON9
extern volatile uint16_t IOCON9 __attribute__((__sfr__));
typedef struct tagIOCON9BITS {
  uint16_t OSYNC:1;
  uint16_t SWAP:1;
  uint16_t CLDAT:2;
  uint16_t FLTDAT:2;
  uint16_t OVRDAT:2;
  uint16_t OVRENL:1;
  uint16_t OVRENH:1;
  uint16_t PMOD:2;
  uint16_t POLL:1;
  uint16_t POLH:1;
  uint16_t PENL:1;
  uint16_t PENH:1;
} IOCON9BITS;
extern volatile IOCON9BITS IOCON9bits __attribute__((__sfr__));

#define FCLCON9 FCLCON9
extern volatile uint16_t FCLCON9 __attribute__((__sfr__));
typedef struct tagFCLCON9BITS {
  uint16_t FLTMOD:2;
  uint16_t FLTPOL:1;
  uint16_t FLTSRC:5;
  uint16_t CLMOD:1;
  uint16_t CLPOL:1;
  uint16_t CLSRC:5;
  uint16_t IFLTMOD:1;
} FCLCON9BITS;
extern volatile FCLCON9BITS FCLCON9bits __attribute__((__sfr__));

#define PDC9 PDC9
extern volatile uint16_t PDC9 __attribute__((__sfr__));
#define PHASE9 PHASE9
extern volatile uint16_t PHASE9 __attribute__((__sfr__));
#define DTR9 DTR9
extern volatile uint16_t DTR9 __attribute__((__sfr__));
typedef struct tagDTR9BITS {
  uint16_t DTR9:14;
} DTR9BITS;
extern volatile DTR9BITS DTR9bits __attribute__((__sfr__));

#define ALTDTR9 ALTDTR9
extern volatile uint16_t ALTDTR9 __attribute__((__sfr__));
typedef struct tagALTDTR9BITS {
  uint16_t ALTDTR9:14;
} ALTDTR9BITS;
extern volatile ALTDTR9BITS ALTDTR9bits __attribute__((__sfr__));

#define SDC9 SDC9
extern volatile uint16_t SDC9 __attribute__((__sfr__));
#define SPHASE9 SPHASE9
extern volatile uint16_t SPHASE9 __attribute__((__sfr__));
#define TRIG9 TRIG9
extern volatile uint16_t TRIG9 __attribute__((__sfr__));
typedef struct tagTRIG9BITS {
  uint16_t :3;
  uint16_t TRGCMP:13;
} TRIG9BITS;
extern volatile TRIG9BITS TRIG9bits __attribute__((__sfr__));

#define TRGCON9 TRGCON9
extern volatile uint16_t TRGCON9 __attribute__((__sfr__));
typedef struct tagTRGCON9BITS {
  uint16_t TRGSTRT:6;
  uint16_t :1;
  uint16_t DTM:1;
  uint16_t :4;
  uint16_t TRGDIV:4;
} TRGCON9BITS;
extern volatile TRGCON9BITS TRGCON9bits __attribute__((__sfr__));

#define STRIG9 STRIG9
extern volatile uint16_t STRIG9 __attribute__((__sfr__));
typedef struct tagSTRIG9BITS {
  uint16_t :3;
  uint16_t STRGCMP:13;
} STRIG9BITS;
extern volatile STRIG9BITS STRIG9bits __attribute__((__sfr__));

#define PWMCAP9 PWMCAP9
extern volatile uint16_t PWMCAP9 __attribute__((__sfr__));
typedef struct tagPWMCAP9BITS {
  uint16_t :3;
  uint16_t PWMCAP9:13;
} PWMCAP9BITS;
extern volatile PWMCAP9BITS PWMCAP9bits __attribute__((__sfr__));

