MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33FJ32GS610/mcu.h
#define LEBCON9 LEBCON9
extern volatile uint16_t LEBCON9 __attribute__((__sfr__));
typedef struct tagLEBCON9BITS {
  uint16_t BPLL:1;
  uint16_t BPLH:1;
  uint16_t BPHL:1;
  uint16_t BPHH:1;
  uint16_t BCL:1;
  uint16_t BCH:1;
  uint16_t :4;
  uint16_t CLLEBEN:1;
  uint16_t FLTLEBEN:1;
  uint16_t PLF:1;
  uint16_t PLR:1;
  uint16_t PHF:1;
  uint16_t PHR:1;
} LEBCON9BITS;
extern volatile LEBCON9BITS LEBCON9bits __attribute__((__sfr__));

#define LEBDLY9 LEBDLY9
extern volatile uint16_t LEBDLY9 __attribute__((__sfr__));
typedef struct tagLEBDLY9BITS {
  uint16_t :3;
  uint16_t LEB:9;
} LEBDLY9BITS;
extern volatile LEBDLY9BITS LEBDLY9bits __attribute__((__sfr__));

#define AUXCON9 AUXCON9
extern volatile uint16_t AUXCON9 __attribute__((__sfr__));
typedef struct tagAUXCON9BITS {
  uint16_t CHOPLEN:1;
  uint16_t CHOPHEN:1;
  uint16_t CHOPSEL:4;
  uint16_t :2;
  uint16_t BLANKSEL:4;
  uint16_t :2;
  uint16_t HRDDIS:1;
  uint16_t HRPDIS:1;
} AUXCON9BITS;
extern volatile AUXCON9BITS AUXCON9bits __attribute__((__sfr__));

#define CMPCON1 CMPCON1
extern volatile uint16_t CMPCON1 __attribute__((__sfr__));
__extension__ typedef struct tagCMPCON1BITS {
  union {
    struct {
      uint16_t RANGE:1;
      uint16_t CMPPOL:1;
      uint16_t :1;
      uint16_t CMPSTAT:1;
      uint16_t :1;
      uint16_t EXTREF:1;
      uint16_t INSEL:2;
      uint16_t DACOE:1;
      uint16_t :4;
      uint16_t CMPSIDL:1;
      uint16_t :1;
      uint16_t CMPON:1;
    };
    struct {
      uint16_t :6;
      uint16_t INSEL0:1;
      uint16_t INSEL1:1;
    };
  };
} CMPCON1BITS;
extern volatile CMPCON1BITS CMPCON1bits __attribute__((__sfr__));

#define CMPDAC1 CMPDAC1
extern volatile uint16_t CMPDAC1 __attribute__((__sfr__));
__extension__ typedef struct tagCMPDAC1BITS {
  union {
    struct {
      uint16_t CMREF:10;
    };
    struct {
      uint16_t CMREF0:1;
      uint16_t CMREF1:1;
      uint16_t CMREF2:1;
      uint16_t CMREF3:1;
      uint16_t CMREF4:1;
      uint16_t CMREF5:1;
      uint16_t CMREF6:1;
      uint16_t CMREF7:1;
      uint16_t CMREF8:1;
      uint16_t CMREF9:1;
    };
  };
} CMPDAC1BITS;
extern volatile CMPDAC1BITS CMPDAC1bits __attribute__((__sfr__));

#define CMPCON2 CMPCON2
extern volatile uint16_t CMPCON2 __attribute__((__sfr__));
__extension__ typedef struct tagCMPCON2BITS {
  union {
    struct {
      uint16_t RANGE:1;
      uint16_t CMPPOL:1;
      uint16_t :1;
      uint16_t CMPSTAT:1;
      uint16_t :1;
      uint16_t EXTREF:1;
      uint16_t INSEL:2;
      uint16_t DACOE:1;
      uint16_t :4;
      uint16_t CMPSIDL:1;
      uint16_t :1;
      uint16_t CMPON:1;
    };
    struct {
      uint16_t :6;
      uint16_t INSEL0:1;
      uint16_t INSEL1:1;
    };
  };
} CMPCON2BITS;
extern volatile CMPCON2BITS CMPCON2bits __attribute__((__sfr__));

#define CMPDAC2 CMPDAC2
extern volatile uint16_t CMPDAC2 __attribute__((__sfr__));
__extension__ typedef struct tagCMPDAC2BITS {
  union {
    struct {
      uint16_t CMREF:10;
    };
    struct {
      uint16_t CMREF0:1;
      uint16_t CMREF1:1;
      uint16_t CMREF2:1;
      uint16_t CMREF3:1;
      uint16_t CMREF4:1;
      uint16_t CMREF5:1;
      uint16_t CMREF6:1;
      uint16_t CMREF7:1;
      uint16_t CMREF8:1;
      uint16_t CMREF9:1;
    };
  };
} CMPDAC2BITS;
extern volatile CMPDAC2BITS CMPDAC2bits __attribute__((__sfr__));

#define CMPCON3 CMPCON3
extern volatile uint16_t CMPCON3 __attribute__((__sfr__));
__extension__ typedef struct tagCMPCON3BITS {
  union {
    struct {
      uint16_t RANGE:1;
      uint16_t CMPPOL:1;
      uint16_t :1;
      uint16_t CMPSTAT:1;
      uint16_t :1;
      uint16_t EXTREF:1;
      uint16_t INSEL:2;
      uint16_t DACOE:1;
      uint16_t :4;
      uint16_t CMPSIDL:1;
      uint16_t :1;
      uint16_t CMPON:1;
    };
    struct {
      uint16_t :6;
      uint16_t INSEL0:1;
      uint16_t INSEL1:1;
    };
  };
} CMPCON3BITS;
extern volatile CMPCON3BITS CMPCON3bits __attribute__((__sfr__));

#define CMPDAC3 CMPDAC3
extern volatile uint16_t CMPDAC3 __attribute__((__sfr__));
__extension__ typedef struct tagCMPDAC3BITS {
  union {
    struct {
      uint16_t CMREF:10;
    };
    struct {
      uint16_t CMREF0:1;
      uint16_t CMREF1:1;
      uint16_t CMREF2:1;
      uint16_t CMREF3:1;
      uint16_t CMREF4:1;
      uint16_t CMREF5:1;
      uint16_t CMREF6:1;
      uint16_t CMREF7:1;
      uint16_t CMREF8:1;
      uint16_t CMREF9:1;
    };
  };
} CMPDAC3BITS;
extern volatile CMPDAC3BITS CMPDAC3bits __attribute__((__sfr__));

#define CMPCON4 CMPCON4
extern volatile uint16_t CMPCON4 __attribute__((__sfr__));
__extension__ typedef struct tagCMPCON4BITS {
  union {
    struct {
      uint16_t RANGE:1;
      uint16_t CMPPOL:1;
      uint16_t :1;
      uint16_t CMPSTAT:1;
      uint16_t :1;
      uint16_t EXTREF:1;
      uint16_t INSEL:2;
      uint16_t DACOE:1;
      uint16_t :4;
      uint16_t CMPSIDL:1;
      uint16_t :1;
      uint16_t CMPON:1;
    };
    struct {
      uint16_t :6;
      uint16_t INSEL0:1;
      uint16_t INSEL1:1;
    };
  };
} CMPCON4BITS;
extern volatile CMPCON4BITS CMPCON4bits __attribute__((__sfr__));

#define CMPDAC4 CMPDAC4
extern volatile uint16_t CMPDAC4 __attribute__((__sfr__));
__extension__ typedef struct tagCMPDAC4BITS {
  union {
    struct {
      uint16_t CMREF:10;
    };
    struct {
      uint16_t CMREF0:1;
      uint16_t CMREF1:1;
      uint16_t CMREF2:1;
      uint16_t CMREF3:1;
      uint16_t CMREF4:1;
      uint16_t CMREF5:1;
      uint16_t CMREF6:1;
      uint16_t CMREF7:1;
      uint16_t CMREF8:1;
      uint16_t CMREF9:1;
    };
  };
} CMPDAC4BITS;
extern volatile CMPDAC4BITS CMPDAC4bits __attribute__((__sfr__));

#define RCON RCON
extern volatile uint16_t RCON __attribute__((__sfr__));
typedef struct tagRCONBITS {
  uint16_t POR:1;
  uint16_t BOR:1;
  uint16_t IDLE:1;
  uint16_t SLEEP:1;
  uint16_t WDTO:1;
  uint16_t SWDTEN:1;
  uint16_t SWR:1;
  uint16_t EXTR:1;
  uint16_t VREGS:1;
  uint16_t :5;
  uint16_t IOPUWR:1;
  uint16_t TRAPR:1;
} RCONBITS;
extern volatile RCONBITS RCONbits __attribute__((__sfr__));

#define OSCCON OSCCON
extern volatile uint16_t OSCCON __attribute__((__sfr__));
__extension__ typedef struct tagOSCCONBITS {
  union {
    struct {
      uint16_t OSWEN:1;
      uint16_t LPOSCEN:1;
      uint16_t :1;
      uint16_t CF:1;
      uint16_t PRCDEN:1;
      uint16_t LOCK:1;
      uint16_t :1;
      uint16_t CLKLOCK:1;
      uint16_t NOSC:3;
      uint16_t :1;
      uint16_t COSC:3;
    };
    struct {
      uint16_t :8;
      uint16_t NOSC0:1;
      uint16_t NOSC1:1;
      uint16_t NOSC2:1;
      uint16_t :1;
      uint16_t COSC0:1;
      uint16_t COSC1:1;
      uint16_t COSC2:1;
    };
  };
} OSCCONBITS;
extern volatile OSCCONBITS OSCCONbits __attribute__((__sfr__));

