MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33FJ32GS610/mcu.h
#define _IOCON6_PMOD_POSITION                    0x0000000A
#define _IOCON6_PMOD_MASK                        0x00000C00
#define _IOCON6_PMOD_LENGTH                      0x00000002

#define _IOCON6_POLL_POSITION                    0x0000000C
#define _IOCON6_POLL_MASK                        0x00001000
#define _IOCON6_POLL_LENGTH                      0x00000001

#define _IOCON6_POLH_POSITION                    0x0000000D
#define _IOCON6_POLH_MASK                        0x00002000
#define _IOCON6_POLH_LENGTH                      0x00000001

#define _IOCON6_PENL_POSITION                    0x0000000E
#define _IOCON6_PENL_MASK                        0x00004000
#define _IOCON6_PENL_LENGTH                      0x00000001

#define _IOCON6_PENH_POSITION                    0x0000000F
#define _IOCON6_PENH_MASK                        0x00008000
#define _IOCON6_PENH_LENGTH                      0x00000001

#define _IOCON6_CLDAT0_POSITION                  0x00000002
#define _IOCON6_CLDAT0_MASK                      0x00000004
#define _IOCON6_CLDAT0_LENGTH                    0x00000001

#define _IOCON6_CLDAT1_POSITION                  0x00000003
#define _IOCON6_CLDAT1_MASK                      0x00000008
#define _IOCON6_CLDAT1_LENGTH                    0x00000001

#define _IOCON6_FLTDAT0_POSITION                 0x00000004
#define _IOCON6_FLTDAT0_MASK                     0x00000010
#define _IOCON6_FLTDAT0_LENGTH                   0x00000001

#define _IOCON6_FLTDAT1_POSITION                 0x00000005
#define _IOCON6_FLTDAT1_MASK                     0x00000020
#define _IOCON6_FLTDAT1_LENGTH                   0x00000001

#define _IOCON6_OVRDAT0_POSITION                 0x00000006
#define _IOCON6_OVRDAT0_MASK                     0x00000040
#define _IOCON6_OVRDAT0_LENGTH                   0x00000001

#define _IOCON6_OVRDAT1_POSITION                 0x00000007
#define _IOCON6_OVRDAT1_MASK                     0x00000080
#define _IOCON6_OVRDAT1_LENGTH                   0x00000001

#define _IOCON6_PMOD0_POSITION                   0x0000000A
#define _IOCON6_PMOD0_MASK                       0x00000400
#define _IOCON6_PMOD0_LENGTH                     0x00000001

#define _IOCON6_PMOD1_POSITION                   0x0000000B
#define _IOCON6_PMOD1_MASK                       0x00000800
#define _IOCON6_PMOD1_LENGTH                     0x00000001

#define _FCLCON6_FLTMOD_POSITION                 0x00000000
#define _FCLCON6_FLTMOD_MASK                     0x00000003
#define _FCLCON6_FLTMOD_LENGTH                   0x00000002

#define _FCLCON6_FLTPOL_POSITION                 0x00000002
#define _FCLCON6_FLTPOL_MASK                     0x00000004
#define _FCLCON6_FLTPOL_LENGTH                   0x00000001

#define _FCLCON6_FLTSRC_POSITION                 0x00000003
#define _FCLCON6_FLTSRC_MASK                     0x000000F8
#define _FCLCON6_FLTSRC_LENGTH                   0x00000005

#define _FCLCON6_CLMOD_POSITION                  0x00000008
#define _FCLCON6_CLMOD_MASK                      0x00000100
#define _FCLCON6_CLMOD_LENGTH                    0x00000001

#define _FCLCON6_CLPOL_POSITION                  0x00000009
#define _FCLCON6_CLPOL_MASK                      0x00000200
#define _FCLCON6_CLPOL_LENGTH                    0x00000001

#define _FCLCON6_CLSRC_POSITION                  0x0000000A
#define _FCLCON6_CLSRC_MASK                      0x00007C00
#define _FCLCON6_CLSRC_LENGTH                    0x00000005

#define _FCLCON6_IFLTMOD_POSITION                0x0000000F
#define _FCLCON6_IFLTMOD_MASK                    0x00008000
#define _FCLCON6_IFLTMOD_LENGTH                  0x00000001

#define _FCLCON6_FLTMOD0_POSITION                0x00000000
#define _FCLCON6_FLTMOD0_MASK                    0x00000001
#define _FCLCON6_FLTMOD0_LENGTH                  0x00000001

#define _FCLCON6_FLTMOD1_POSITION                0x00000001
#define _FCLCON6_FLTMOD1_MASK                    0x00000002
#define _FCLCON6_FLTMOD1_LENGTH                  0x00000001

#define _FCLCON6_FLTSRC0_POSITION                0x00000003
#define _FCLCON6_FLTSRC0_MASK                    0x00000008
#define _FCLCON6_FLTSRC0_LENGTH                  0x00000001

#define _FCLCON6_FLTSRC1_POSITION                0x00000004
#define _FCLCON6_FLTSRC1_MASK                    0x00000010
#define _FCLCON6_FLTSRC1_LENGTH                  0x00000001

#define _FCLCON6_FLTSRC2_POSITION                0x00000005
#define _FCLCON6_FLTSRC2_MASK                    0x00000020
#define _FCLCON6_FLTSRC2_LENGTH                  0x00000001

#define _FCLCON6_FLTSRC3_POSITION                0x00000006
#define _FCLCON6_FLTSRC3_MASK                    0x00000040
#define _FCLCON6_FLTSRC3_LENGTH                  0x00000001

#define _FCLCON6_FLTSRC4_POSITION                0x00000007
#define _FCLCON6_FLTSRC4_MASK                    0x00000080
#define _FCLCON6_FLTSRC4_LENGTH                  0x00000001

#define _FCLCON6_CLSRC0_POSITION                 0x0000000A
#define _FCLCON6_CLSRC0_MASK                     0x00000400
#define _FCLCON6_CLSRC0_LENGTH                   0x00000001

#define _FCLCON6_CLSRC1_POSITION                 0x0000000B
#define _FCLCON6_CLSRC1_MASK                     0x00000800
#define _FCLCON6_CLSRC1_LENGTH                   0x00000001

#define _FCLCON6_CLSRC2_POSITION                 0x0000000C
#define _FCLCON6_CLSRC2_MASK                     0x00001000
#define _FCLCON6_CLSRC2_LENGTH                   0x00000001

#define _FCLCON6_CLSRC3_POSITION                 0x0000000D
#define _FCLCON6_CLSRC3_MASK                     0x00002000
#define _FCLCON6_CLSRC3_LENGTH                   0x00000001

#define _FCLCON6_CLSRC4_POSITION                 0x0000000E
#define _FCLCON6_CLSRC4_MASK                     0x00004000
#define _FCLCON6_CLSRC4_LENGTH                   0x00000001

#define _TRIG6_TRGCMP_POSITION                   0x00000003
#define _TRIG6_TRGCMP_MASK                       0x0000FFF8
#define _TRIG6_TRGCMP_LENGTH                     0x0000000D

#define _TRIG6_TRGCMP0_POSITION                  0x00000003
#define _TRIG6_TRGCMP0_MASK                      0x00000008
#define _TRIG6_TRGCMP0_LENGTH                    0x00000001

#define _TRIG6_TRGCMP1_POSITION                  0x00000004
#define _TRIG6_TRGCMP1_MASK                      0x00000010
#define _TRIG6_TRGCMP1_LENGTH                    0x00000001

#define _TRIG6_TRGCMP2_POSITION                  0x00000005
#define _TRIG6_TRGCMP2_MASK                      0x00000020
#define _TRIG6_TRGCMP2_LENGTH                    0x00000001

#define _TRIG6_TRGCMP3_POSITION                  0x00000006
#define _TRIG6_TRGCMP3_MASK                      0x00000040
#define _TRIG6_TRGCMP3_LENGTH                    0x00000001

