MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33FJ32GS610/mcu.h
#define _FCLCON7_FLTMOD_POSITION                 0x00000000
#define _FCLCON7_FLTMOD_MASK                     0x00000003
#define _FCLCON7_FLTMOD_LENGTH                   0x00000002

#define _FCLCON7_FLTPOL_POSITION                 0x00000002
#define _FCLCON7_FLTPOL_MASK                     0x00000004
#define _FCLCON7_FLTPOL_LENGTH                   0x00000001

#define _FCLCON7_FLTSRC_POSITION                 0x00000003
#define _FCLCON7_FLTSRC_MASK                     0x000000F8
#define _FCLCON7_FLTSRC_LENGTH                   0x00000005

#define _FCLCON7_CLMOD_POSITION                  0x00000008
#define _FCLCON7_CLMOD_MASK                      0x00000100
#define _FCLCON7_CLMOD_LENGTH                    0x00000001

#define _FCLCON7_CLPOL_POSITION                  0x00000009
#define _FCLCON7_CLPOL_MASK                      0x00000200
#define _FCLCON7_CLPOL_LENGTH                    0x00000001

#define _FCLCON7_CLSRC_POSITION                  0x0000000A
#define _FCLCON7_CLSRC_MASK                      0x00007C00
#define _FCLCON7_CLSRC_LENGTH                    0x00000005

#define _FCLCON7_IFLTMOD_POSITION                0x0000000F
#define _FCLCON7_IFLTMOD_MASK                    0x00008000
#define _FCLCON7_IFLTMOD_LENGTH                  0x00000001

#define _FCLCON7_FLTMOD0_POSITION                0x00000000
#define _FCLCON7_FLTMOD0_MASK                    0x00000001
#define _FCLCON7_FLTMOD0_LENGTH                  0x00000001

#define _FCLCON7_FLTMOD1_POSITION                0x00000001
#define _FCLCON7_FLTMOD1_MASK                    0x00000002
#define _FCLCON7_FLTMOD1_LENGTH                  0x00000001

#define _FCLCON7_FLTSRC0_POSITION                0x00000003
#define _FCLCON7_FLTSRC0_MASK                    0x00000008
#define _FCLCON7_FLTSRC0_LENGTH                  0x00000001

#define _FCLCON7_FLTSRC1_POSITION                0x00000004
#define _FCLCON7_FLTSRC1_MASK                    0x00000010
#define _FCLCON7_FLTSRC1_LENGTH                  0x00000001

#define _FCLCON7_FLTSRC2_POSITION                0x00000005
#define _FCLCON7_FLTSRC2_MASK                    0x00000020
#define _FCLCON7_FLTSRC2_LENGTH                  0x00000001

#define _FCLCON7_FLTSRC3_POSITION                0x00000006
#define _FCLCON7_FLTSRC3_MASK                    0x00000040
#define _FCLCON7_FLTSRC3_LENGTH                  0x00000001

#define _FCLCON7_FLTSRC4_POSITION                0x00000007
#define _FCLCON7_FLTSRC4_MASK                    0x00000080
#define _FCLCON7_FLTSRC4_LENGTH                  0x00000001

#define _FCLCON7_CLSRC0_POSITION                 0x0000000A
#define _FCLCON7_CLSRC0_MASK                     0x00000400
#define _FCLCON7_CLSRC0_LENGTH                   0x00000001

#define _FCLCON7_CLSRC1_POSITION                 0x0000000B
#define _FCLCON7_CLSRC1_MASK                     0x00000800
#define _FCLCON7_CLSRC1_LENGTH                   0x00000001

#define _FCLCON7_CLSRC2_POSITION                 0x0000000C
#define _FCLCON7_CLSRC2_MASK                     0x00001000
#define _FCLCON7_CLSRC2_LENGTH                   0x00000001

#define _FCLCON7_CLSRC3_POSITION                 0x0000000D
#define _FCLCON7_CLSRC3_MASK                     0x00002000
#define _FCLCON7_CLSRC3_LENGTH                   0x00000001

#define _FCLCON7_CLSRC4_POSITION                 0x0000000E
#define _FCLCON7_CLSRC4_MASK                     0x00004000
#define _FCLCON7_CLSRC4_LENGTH                   0x00000001

#define _TRIG7_TRGCMP_POSITION                   0x00000003
#define _TRIG7_TRGCMP_MASK                       0x0000FFF8
#define _TRIG7_TRGCMP_LENGTH                     0x0000000D

#define _TRIG7_TRGCMP0_POSITION                  0x00000003
#define _TRIG7_TRGCMP0_MASK                      0x00000008
#define _TRIG7_TRGCMP0_LENGTH                    0x00000001

#define _TRIG7_TRGCMP1_POSITION                  0x00000004
#define _TRIG7_TRGCMP1_MASK                      0x00000010
#define _TRIG7_TRGCMP1_LENGTH                    0x00000001

#define _TRIG7_TRGCMP2_POSITION                  0x00000005
#define _TRIG7_TRGCMP2_MASK                      0x00000020
#define _TRIG7_TRGCMP2_LENGTH                    0x00000001

#define _TRIG7_TRGCMP3_POSITION                  0x00000006
#define _TRIG7_TRGCMP3_MASK                      0x00000040
#define _TRIG7_TRGCMP3_LENGTH                    0x00000001

#define _TRIG7_TRGCMP4_POSITION                  0x00000007
#define _TRIG7_TRGCMP4_MASK                      0x00000080
#define _TRIG7_TRGCMP4_LENGTH                    0x00000001

#define _TRIG7_TRGCMP5_POSITION                  0x00000008
#define _TRIG7_TRGCMP5_MASK                      0x00000100
#define _TRIG7_TRGCMP5_LENGTH                    0x00000001

#define _TRIG7_TRGCMP6_POSITION                  0x00000009
#define _TRIG7_TRGCMP6_MASK                      0x00000200
#define _TRIG7_TRGCMP6_LENGTH                    0x00000001

#define _TRIG7_TRGCMP7_POSITION                  0x0000000A
#define _TRIG7_TRGCMP7_MASK                      0x00000400
#define _TRIG7_TRGCMP7_LENGTH                    0x00000001

#define _TRIG7_TRGCMP8_POSITION                  0x0000000B
#define _TRIG7_TRGCMP8_MASK                      0x00000800
#define _TRIG7_TRGCMP8_LENGTH                    0x00000001

#define _TRIG7_TRGCMP9_POSITION                  0x0000000C
#define _TRIG7_TRGCMP9_MASK                      0x00001000
#define _TRIG7_TRGCMP9_LENGTH                    0x00000001

#define _TRIG7_TRGCMP10_POSITION                 0x0000000D
#define _TRIG7_TRGCMP10_MASK                     0x00002000
#define _TRIG7_TRGCMP10_LENGTH                   0x00000001

#define _TRIG7_TRGCMP11_POSITION                 0x0000000E
#define _TRIG7_TRGCMP11_MASK                     0x00004000
#define _TRIG7_TRGCMP11_LENGTH                   0x00000001

#define _TRIG7_TRGCMP12_POSITION                 0x0000000F
#define _TRIG7_TRGCMP12_MASK                     0x00008000
#define _TRIG7_TRGCMP12_LENGTH                   0x00000001

#define _TRGCON7_TRGSTRT_POSITION                0x00000000
#define _TRGCON7_TRGSTRT_MASK                    0x0000003F
#define _TRGCON7_TRGSTRT_LENGTH                  0x00000006

#define _TRGCON7_DTM_POSITION                    0x00000007
#define _TRGCON7_DTM_MASK                        0x00000080
#define _TRGCON7_DTM_LENGTH                      0x00000001

#define _TRGCON7_TRGDIV_POSITION                 0x0000000C
#define _TRGCON7_TRGDIV_MASK                     0x0000F000
#define _TRGCON7_TRGDIV_LENGTH                   0x00000004

#define _TRGCON7_TRGSTRT0_POSITION               0x00000000
#define _TRGCON7_TRGSTRT0_MASK                   0x00000001
#define _TRGCON7_TRGSTRT0_LENGTH                 0x00000001

#define _TRGCON7_TRGSTRT1_POSITION               0x00000001
#define _TRGCON7_TRGSTRT1_MASK                   0x00000002
#define _TRGCON7_TRGSTRT1_LENGTH                 0x00000001

#define _TRGCON7_TRGSTRT2_POSITION               0x00000002
#define _TRGCON7_TRGSTRT2_MASK                   0x00000004
#define _TRGCON7_TRGSTRT2_LENGTH                 0x00000001

