MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33FJ32GS610/mcu.h
#define _FCLCON9_FLTSRC_POSITION                 0x00000003
#define _FCLCON9_FLTSRC_MASK                     0x000000F8
#define _FCLCON9_FLTSRC_LENGTH                   0x00000005

#define _FCLCON9_CLMOD_POSITION                  0x00000008
#define _FCLCON9_CLMOD_MASK                      0x00000100
#define _FCLCON9_CLMOD_LENGTH                    0x00000001

#define _FCLCON9_CLPOL_POSITION                  0x00000009
#define _FCLCON9_CLPOL_MASK                      0x00000200
#define _FCLCON9_CLPOL_LENGTH                    0x00000001

#define _FCLCON9_CLSRC_POSITION                  0x0000000A
#define _FCLCON9_CLSRC_MASK                      0x00007C00
#define _FCLCON9_CLSRC_LENGTH                    0x00000005

#define _FCLCON9_IFLTMOD_POSITION                0x0000000F
#define _FCLCON9_IFLTMOD_MASK                    0x00008000
#define _FCLCON9_IFLTMOD_LENGTH                  0x00000001

#define _DTR9_DTR9_POSITION                      0x00000000
#define _DTR9_DTR9_MASK                          0x00003FFF
#define _DTR9_DTR9_LENGTH                        0x0000000E

#define _ALTDTR9_ALTDTR9_POSITION                0x00000000
#define _ALTDTR9_ALTDTR9_MASK                    0x00003FFF
#define _ALTDTR9_ALTDTR9_LENGTH                  0x0000000E

#define _TRIG9_TRGCMP_POSITION                   0x00000003
#define _TRIG9_TRGCMP_MASK                       0x0000FFF8
#define _TRIG9_TRGCMP_LENGTH                     0x0000000D

#define _TRGCON9_TRGSTRT_POSITION                0x00000000
#define _TRGCON9_TRGSTRT_MASK                    0x0000003F
#define _TRGCON9_TRGSTRT_LENGTH                  0x00000006

#define _TRGCON9_DTM_POSITION                    0x00000007
#define _TRGCON9_DTM_MASK                        0x00000080
#define _TRGCON9_DTM_LENGTH                      0x00000001

#define _TRGCON9_TRGDIV_POSITION                 0x0000000C
#define _TRGCON9_TRGDIV_MASK                     0x0000F000
#define _TRGCON9_TRGDIV_LENGTH                   0x00000004

#define _STRIG9_STRGCMP_POSITION                 0x00000003
#define _STRIG9_STRGCMP_MASK                     0x0000FFF8
#define _STRIG9_STRGCMP_LENGTH                   0x0000000D

#define _PWMCAP9_PWMCAP9_POSITION                0x00000003
#define _PWMCAP9_PWMCAP9_MASK                    0x0000FFF8
#define _PWMCAP9_PWMCAP9_LENGTH                  0x0000000D

#define _LEBCON9_BPLL_POSITION                   0x00000000
#define _LEBCON9_BPLL_MASK                       0x00000001
#define _LEBCON9_BPLL_LENGTH                     0x00000001

#define _LEBCON9_BPLH_POSITION                   0x00000001
#define _LEBCON9_BPLH_MASK                       0x00000002
#define _LEBCON9_BPLH_LENGTH                     0x00000001

#define _LEBCON9_BPHL_POSITION                   0x00000002
#define _LEBCON9_BPHL_MASK                       0x00000004
#define _LEBCON9_BPHL_LENGTH                     0x00000001

#define _LEBCON9_BPHH_POSITION                   0x00000003
#define _LEBCON9_BPHH_MASK                       0x00000008
#define _LEBCON9_BPHH_LENGTH                     0x00000001

#define _LEBCON9_BCL_POSITION                    0x00000004
#define _LEBCON9_BCL_MASK                        0x00000010
#define _LEBCON9_BCL_LENGTH                      0x00000001

#define _LEBCON9_BCH_POSITION                    0x00000005
#define _LEBCON9_BCH_MASK                        0x00000020
#define _LEBCON9_BCH_LENGTH                      0x00000001

#define _LEBCON9_CLLEBEN_POSITION                0x0000000A
#define _LEBCON9_CLLEBEN_MASK                    0x00000400
#define _LEBCON9_CLLEBEN_LENGTH                  0x00000001

#define _LEBCON9_FLTLEBEN_POSITION               0x0000000B
#define _LEBCON9_FLTLEBEN_MASK                   0x00000800
#define _LEBCON9_FLTLEBEN_LENGTH                 0x00000001

#define _LEBCON9_PLF_POSITION                    0x0000000C
#define _LEBCON9_PLF_MASK                        0x00001000
#define _LEBCON9_PLF_LENGTH                      0x00000001

#define _LEBCON9_PLR_POSITION                    0x0000000D
#define _LEBCON9_PLR_MASK                        0x00002000
#define _LEBCON9_PLR_LENGTH                      0x00000001

#define _LEBCON9_PHF_POSITION                    0x0000000E
#define _LEBCON9_PHF_MASK                        0x00004000
#define _LEBCON9_PHF_LENGTH                      0x00000001

#define _LEBCON9_PHR_POSITION                    0x0000000F
#define _LEBCON9_PHR_MASK                        0x00008000
#define _LEBCON9_PHR_LENGTH                      0x00000001

#define _LEBDLY9_LEB_POSITION                    0x00000003
#define _LEBDLY9_LEB_MASK                        0x00000FF8
#define _LEBDLY9_LEB_LENGTH                      0x00000009

#define _AUXCON9_CHOPLEN_POSITION                0x00000000
#define _AUXCON9_CHOPLEN_MASK                    0x00000001
#define _AUXCON9_CHOPLEN_LENGTH                  0x00000001

#define _AUXCON9_CHOPHEN_POSITION                0x00000001
#define _AUXCON9_CHOPHEN_MASK                    0x00000002
#define _AUXCON9_CHOPHEN_LENGTH                  0x00000001

#define _AUXCON9_CHOPSEL_POSITION                0x00000002
#define _AUXCON9_CHOPSEL_MASK                    0x0000003C
#define _AUXCON9_CHOPSEL_LENGTH                  0x00000004

#define _AUXCON9_BLANKSEL_POSITION               0x00000008
#define _AUXCON9_BLANKSEL_MASK                   0x00000F00
#define _AUXCON9_BLANKSEL_LENGTH                 0x00000004

#define _AUXCON9_HRDDIS_POSITION                 0x0000000E
#define _AUXCON9_HRDDIS_MASK                     0x00004000
#define _AUXCON9_HRDDIS_LENGTH                   0x00000001

#define _AUXCON9_HRPDIS_POSITION                 0x0000000F
#define _AUXCON9_HRPDIS_MASK                     0x00008000
#define _AUXCON9_HRPDIS_LENGTH                   0x00000001

#define _CMPCON1_RANGE_POSITION                  0x00000000
#define _CMPCON1_RANGE_MASK                      0x00000001
#define _CMPCON1_RANGE_LENGTH                    0x00000001

#define _CMPCON1_CMPPOL_POSITION                 0x00000001
#define _CMPCON1_CMPPOL_MASK                     0x00000002
#define _CMPCON1_CMPPOL_LENGTH                   0x00000001

#define _CMPCON1_CMPSTAT_POSITION                0x00000003
#define _CMPCON1_CMPSTAT_MASK                    0x00000008
#define _CMPCON1_CMPSTAT_LENGTH                  0x00000001

#define _CMPCON1_EXTREF_POSITION                 0x00000005
#define _CMPCON1_EXTREF_MASK                     0x00000020
#define _CMPCON1_EXTREF_LENGTH                   0x00000001

#define _CMPCON1_INSEL_POSITION                  0x00000006
#define _CMPCON1_INSEL_MASK                      0x000000C0
#define _CMPCON1_INSEL_LENGTH                    0x00000002

#define _CMPCON1_DACOE_POSITION                  0x00000008
#define _CMPCON1_DACOE_MASK                      0x00000100
#define _CMPCON1_DACOE_LENGTH                    0x00000001

#define _CMPCON1_CMPSIDL_POSITION                0x0000000D
#define _CMPCON1_CMPSIDL_MASK                    0x00002000
#define _CMPCON1_CMPSIDL_LENGTH                  0x00000001

#define _CMPCON1_CMPON_POSITION                  0x0000000F
#define _CMPCON1_CMPON_MASK                      0x00008000
#define _CMPCON1_CMPON_LENGTH                    0x00000001

